Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh1-6-v3.tmx
Source language: bo
Languages: en

source: །རྒྱལ་པོ་ཀྲྀ་ཀཱིས་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་ཡུལ་ཀ་ཤི་ནས་ལྗོངས་རྒྱུ་ཞིང་གཤེགས་པ་དང་བཱ་རཱ་ཎ་སཱིར་གཤེགས་ཏེ། བཱ་རཱ་ཎ་སཱིའི་དྲང་སྲོང་སྨྲ་བ་རི་དགས་ཀྱི་ནགས་ན་བཞུགས་སོ་ཞེས་ཐོས་སོ། །ཐོས་ནས་ཀྱང་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་གང་ན་བ་དེར་སོང་སྟེ།
en: “When King Kṛkin heard that the Completely Awakened One Kāśyapa, having traveled through Kāśi, had arrived in Vārāṇasī and was staying in Ṛṣivadana Deer Park near Vārāṇasī, he went to the Completely Awakened One Kāśyapa.

source: ཕྱིན་པ་དང་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་གི་ཞབས་གཉིས་ལ་མགོ་བོས་ཕྱག་བྱས་ཏེ་ཕྱོགས་གཅིག་ཏུ་འདུག་གོ།
en: Upon his arrival, he bowed low until his forehead touched the feet of the Completely Awakened One Kāśyapa, and then he sat down to one side.

source: །ཕྱོགས་གཅིག་ཏུ་འདུག་པ་དང་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་གིས་རྒྱལ་པོ་ཀྲྀ་ཀཱི་ལ་ཆོས་དང་ལྡན་པའི་གཏམ་གྱིས་ཡང་དག་པར་སྟོན་པར་མཛད། ཡང་དག་པར་འཛིན་དུ་འཇུག་པར་མཛད། ཡང་དག་པར་གཟེངས་སྟོད་པར་མཛད། ཡང་དག་པར་རབ་ཏུ་དགའ་བར་མཛད་དེ།
en: When he had sat down to one side, the Completely Awakened One Kāśyapa, through talk consistent with the Dharma, instructed, inspired, encouraged, and delighted King Kṛkin.

source: །དེ་ནས་རྒྱལ་པོ་ཀྲྀ་ཀཱི་སྟན་ལས་ལངས་ཏེ་བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ནས་པུས་མོ་གཡས་པའི་ལྷ་ང་ས་ལ་བཙུགས་ཏེ། ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་གང་ན་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་ནས་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་དགེ་སློང་གི་དགེ་འདུན་དང་ཐབས་ཅིག་ལ་སང་བདག་གིས་གདུགས་ཚོད་སྦྱོར་ཞིང་མཆིས་ན་གནང་བར་མཛད་དུ་གསོལ།
en: Then King Kṛkin rose from his seat, draped his upper robe over one shoulder, fell on his right knee, made the gesture of supplication to the Completely Awakened One Kāśyapa, and said to the Completely Awakened One Kāśyapa, ‘May the Blessed One together with the community of monks assent to my offer of a meal at my house tomorrow.’

source: ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་གིས་རྒྱལ་པོ་ཀྲྀ་ཀཱི་ལ་ཅང་མི་གསུང་བས་གནང་ངོ་།
en: “The Completely Awakened One Kāśyapa assented to King Kṛkin by remaining silent.

source: །དེ་ནས་རྒྱལ་པོ་ཀྲྀ་ཀཱིས་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་ཅང་མི་གསུང་བས་གནང་བར་རིག་ནས། ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་གི་ཞབས་གཉིས་ལ་མགོ་བོས་ཕྱག་བྱས་ཏེ་སྟན་ལས་ལངས་ནས་སོང་ངོ་།
en: Then King Kṛkin, knowing that the Completely Awakened One Kāśyapa had assented by remaining silent, bowed low until his forehead touched the feet of the Completely Awakened One Kāśyapa, rose from his seat, and departed.

source: །དེ་ནས་རྒྱལ་པོ་ཀྲྀ་ཀཱིས་དེ་ཉིད་ཀྱི་ནུབ་མོ་ནས་གཙང་ཞིང་བསོད་པའི་བཟའ་བ་དང་། བཅའ་བ་རྣམས་སྟ་གོན་བྱས་ནས་ནང་པར་སྔར་ལངས་ཏེ་གདན་བཤམས།
en: Thereupon King Kṛkin prepared a pure and fine meal during the night.

source: ནོར་བུའི་ཆུ་སྣོད་བཞག་ནས་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་ལ་དུས་ཚོད་གསོལ་པ།
en: After he rose at dawn, he prepared seats, set up a jeweled pitcher, and let the Completely Awakened One Kāśyapa know the time by messenger:

source: དེ་ནས་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་སྔ་དྲོ་ན་བཟའ་ཤམ་ཐབས་མནབས་ལྷུང་བཟེད་དང་ཆོས་གོས་བསྣམས་ཏེ། དགེ་སློང་གི་ཚོགས་ཀྱིས་ཡོངས་སུ་བསྐོར་ཅིང་། དགེ་སློང་གི་དགེ་འདུན་གྱིས་མདུན་དུ་བདར་ཏེ། རྒྱལ་པོ་ཀྲྀ་ཀཱིའི་བཀད་ས་གང་ན་བ་དེར་གཤེགས་ཏེ་བྱོན་ནས་དགེ་སློང་གི་དགེ་འདུན་གྱི་གུང་ལ་གདན་བཤམས་པ་ཉིད་ལ་བཞུགས་སོ།
en: “Then early that morning the Completely Awakened One Kāśyapa dressed, took his bowl and his robe, and, surrounded by a group of monks, went to the dining hall of King Kṛkin, followed by the community of monks.

source: །དེ་ནས་རྒྱལ་པོ་ཀྲྀ་ཀཱིས་སངས་རྒྱས་ལ་སོགས་པ་དགེ་སློང་གི་དགེ་འདུན་བདེ་བར་བཞུགས་ཟིན་པར་རིག་ནས་གཙང་ཞིང་བསོད་པའི་བཟའ་བ་དང་། བཅའ་བ་རྣམས་ཀྱིས་རང་གི་ལག་ནས་སྟོབས་ཤིང་ཚིམ་པར་བྱེད་དེ།
en: When he arrived, he sat on the seat prepared for him in front of the community of monks. King Kṛkin then knew that the community of monks headed by the Completely Awakened One Kāśyapa had sat down in comfort, and with his own hands he served and satisfied them with a pure and fine meal.

source: གཙང་ཞིང་བསོད་པའི་བཟའ་བ་དང་བཅའ་བ་རྣམས་ཀྱིས་རང་གི་ལག་ནས་བསྟབས་ཤིང་ཚིམ་པར་བྱས་ཏེ། ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་གིས་གསོལ་ཟིན་ནས་ཕྱག་བཅབས་ཏེ།
en: Having thus, with his own hands, served and satisfied them in a variety of ways with a pure and fine meal, knowing that the Completely Awakened One Kāśyapa had finished his meal and washed his hands and his bowl, the king made a request before the Completely Awakened One Kāśyapa:

source: ལྷུང་བཟེད་གྱུ་བར་རིག་ནས་སྟན་ཆེས་དམའ་བ་ཞིག་བླངས་ཏེ། ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་གི་སྤྱན་སྔར་གསོལ་བ་བཏབ་པ་བཅོམ་ལྡན་འདས་དགེ་སློང་གི་དགེ་འདུན་དང་ཐབས་ཅིག་ལ་བདག་གིས་དགུང་ཟླ་གསུམ་དུ་ན་བཟའ་ཆོས་གོས་དང་། བསོད་སྙོམས་དང་། གཟིམས་ཆ་དང་། སྙུན་དཔྱད་ཀྱི་རྐྱེན་སྨན་གྱི་ཡོ་བྱད་རྣམས་འབུལ་ཞིང་། བདག་གིས་བཅོམ་ལྡན་འདས་ཀྱི་སླད་དུ་གཙུག་ལག་ཁང་ལྔ་བརྒྱ་ཙམ་བརྩིག་ཅིང་ཁྲི་དང་ཁྲིའུ་དང་། སྟན་ནང་ཚངས་ཅན་དང་། སྔས་ནང་ཚངས་ཅན་དང་། གོར་བུ་ལྔ་བརྒྱ་ཙམ་དབུལ་ཞིང་འབྲས་སྦུབས་སུ་སྨིན་པ་དེ་ལྟ་བུ་འདིས་བཅོམ་ལྡན་འདས་དགེ་སློང་གི་དགེ་འདུན་ལ་བསྙེན་བཀུར་བགྱིད་ལགས་ན་གནང་བར་མཛད་དུ་གསོལ།
en: ‘May the Blessed One together with the community of monks assent to my offer of the requisites for three months, namely, robes, almsfood, bedding and seats, and medicines for the sick, and my offer to build five hundred monasteries for the Blessed One, providing five hundred couches, stools, cushions, pillows, and square blankets, and serving rice covered with leaves to the Blessed One and the community of monks.’

source: རྒྱལ་པོ་ཆེན་པོ་ཇི་ཙམ་སེམས་མངོན་པར་དད་པར་བྱས་པ་དེ་ཙམ་གྱིས་བྱས་ཟིན་གྱིས་ཆོག་གོ།
en: “ ‘Great King, it is enough that you have gained faith.’

source: །ལན་གཉིས་ལན་གསུམ་དུ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་ལ་རྒྱལ་པོ་ཀྲྀ་ཀཱིས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་དགེ་སློང་གི་དགེ་འདུན་དང་ཐབས་ཅིག་ལ་ཞེས་བྱ་བ་ནས། བདག་ལ་གནང་བར་མཛད་དུ་གསོལ་ཞེས་བྱ་བའི་བར་གོང་མ་བཞིན་དུའོ།
en: “King Kṛkin asked the Completely Awakened One Kāśyapa a second and a third time, ‘May the Blessed One together with the community of monks assent to my offer . . . .’

source: །ལན་གཉིས་ལན་གསུམ་དུ་ཡང་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་གིས་རྒྱལ་པོ་ཀྲྀ་ཀཱི་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །རྒྱལ་པོ་ཆེན་པོ་ཇི་ཙམ་སེམས་མངོན་པར་དད་པར་བྱས་པ་དེ་ཙམ་གྱིས་བྱས་ཟིན་གྱིས་ཆོག་གོ།
en: “The Completely Awakened One Kāśyapa answered King Kṛkin a second and a third time, ‘Great King, it is enough that you have gained faith.’

source: །དེ་ནས་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་ལ་རྒྱལ་པོ་ཀྲྀ་ཀཱིས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཙུན་པ་བཅོམ་ལྡན་འདས་ལ་བསྙེན་བཀུར་བགྱིད་པ། དཔེར་ན་ད་ལྟར་གྱི་བདག་འདྲ་བ་གཞན་འགའ་ལྟ་མཆིས་ལགས་སམ།
en: “Then King Kṛkin asked the Completely Awakened One Kāśyapa, ‘O Honored One, is there anyone else who serves the Blessed One like me?’

source: རྒྱལ་པོ་ཆེན་པོ་ཁྱོད་ཉིད་ཀྱི་ཡུལ་ན་བཻ་བྷི་ཊིང་གི་ཞེས་བྱ་བའི་གྲོང་ཡོད་དེ། དེ་ན་རྫ་མཁན་དགའ་སྐྱོང་ཞེས་བྱ་བ་སངས་རྒྱས་ལ་མངོན་པར་དད་པ་ཞེས་བྱ་བ་ནས་གནས་སོ་ཞེས་བྱ་བའི་བར་གོང་མ་བཞིན་དུའོ།
en: “ ‘Great King, in your country, there is a town named Vaibhiḍiṅgī, and there lives a potter named Nandīpāla, who has faith in the Buddha . . . .

source: །དེས་ཕ་མ་ལོང་བ་གཉིས་གསོ་ཞིང་དུས་དུས་སུ་ང་ལ་ཡང་བསོད་སྙོམས་ཀྱིས་སྟོབས་པར་བྱེད་དེ།
en: He cares for his blind parents and often brings me almsfood.

source: རྒྱལ་པོ་ཆེན་པོ་དུས་གཅིག་ཅིག་ན་ང་བཻ་བྷི་ཊིང་གིའི་ལྗོངས་ཀྱི་གྲོང་རྡལ་ན་ཉེ་བར་བསྟེན་ཅིང་བཞུགས་ནས་སྔ་དྲོ་ཤམ་ཐབས་མནབས་ཏེ་ལྷུང་བཟེད་དང་ཆོས་གོས་བསྣམས་ནས། བཻ་བྷི་ཊིང་གི་ལྗོངས་ཀྱི་གྲོང་རྡལ་དུ་བསོད་སྙོམས་ལ་ཞུགས་ཏེ།
en: “ ‘Great King, I once stayed near the provincial town of Vaibhiḍiṅgī. I dressed early in the morning, took my bowl and my robe, and entered the provincial town of Vaibhiḍiṅgī for alms.

source: ངས་བཻ་བྷི་ཊིང་གིར་བསོད་སྙོམས་སྤྱོད་ཅིང་རྫ་མཁན་དགའ་སྐྱོང་གི་ཁྱིམ་གང་ན་བ་དེར་གཤེགས་པ་དང་། དེའི་ཚེ་རྫ་མཁན་དགའ་སྐྱོང་དགོས་པ་ཞིག་ལ་ཕྱི་ལོགས་སུ་སོང་ནས།
en: Walking for alms in Vaibhiḍiṅgī, I went to the potter Nandīpāla’s house. At that time the potter Nandīpāla was away on some business.

source: ངས་རྫ་མཁན་དགའ་སྐྱོང་གི་སྒོ་འཕར་ལ་རིམ་གྱིས་དལ་བུ་དལ་བུས་བརྡུངས་པ་ལས་རྫ་མཁན་དགའ་སྐྱོང་གི་ཕ་དང་མས་སྒོ་འཕར་ལ་བརྡུངས་པའི་སྒྲ་ཐོས་སོ།
en: When I knocked softly on the gate crossbar, the parents of the potter Nandīpāla heard the gate crossbar being knocked.

source: །ཐོས་ནས་ཀྱང་འདི་སྐད་ཅེས་སྨྲས་སོ། །འཕགས་པ་འདི་སུ་ཞིག་བཞིན་བཟངས་འདི་སུ་ཞིག་རྫ་མཁན་དགའ་སྐྱོང་གི་སྒོ་འཕར་ལ་རྡུང་།
en: When they heard it, they asked, “Which noble one, which gentleman, is knocking on the gate crossbar of the potter Nandīpāla?”

source: དེ་གཉིས་ལ་ངས་འདི་སྐད་ཅེས་སྨྲས་ཏེ། ང་ནི་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་ཡིན་ཏེ་བསོད་སྙོམས་བཞེད་དོ།
en: “ ‘I answered them, “I am the Completely Awakened One Kāśyapa and am asking for almsfood.”

source: །དེ་གཉིས་ཀྱིས་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: “ ‘ “O noble one, please come in,” the two of them said to me.

source: །འཕགས་པ་ནང་དུ་སྤྱོན་ཅིག།
en: “O sir, please come in.

source: བཞིན་བཟངས་ནང་དུ་སྤྱོན་ཅིག །ཁྱོད་ལ་རིམ་གྲོ་བགྱིད་པ་ནི་སླད་རོལ་དུ་མཆིས་ཀྱིས་ཕྲུ་བ་ན་ཟན་དྲོན་དང་རྫེའུ་ན་སྲན་ཚོད་མཆིས་ཀྱིས་ཉིད་ཀྱིས་བཞེས་ཏེ་ལོངས་སྤྱད་དུ་གསོལ།
en: The one who would serve you is away. There is kulmāṣa in a pot and soup in a small pot. Please help yourself.”

source: རྒྱལ་པོ་ཆེན་པོ་ངས་བྱང་གི་སྒྲ་མི་སྙན་གྱི་དུས་བྱིན་གྱིས་བརླབས་ནས་ཕྲུ་བ་ན་ཟན་དྲོན་དང་། རྗེའུ་ན་སྲན་ཚོད་ཡོད་པ་དེ་ཉིད་ཀྱིས་བླངས་ནས་ལོངས་སྤྱད་དོ།
en: “ ‘Great King, I decided that it was the time of Kuru in the north and helped myself to the kulmāṣa in the pot and soup in the small pot.

source: །དེ་ནས་ཕྱི་ཞིག་ན་རྫ་མཁན་དགའ་སྐྱོང་འོངས་ནས་ཕྲུ་བ་ན་ཟན་དྲོན་དང་རྫེའུ་ན་སྲན་ཚོད་ཡོད་པ་ཟོས་པར་མཐོང་ནས་ཕ་མ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: After that, the potter Nandīpāla came home.

source: །ཡབ་ཡུམ་ཕྲུ་བ་ན་ཟན་དྲོན་དང་རྫེའུའི་སྲན་ཚོད་སུ་ཞིག་གིས་འཚལ་ལགས།
en: When he saw that these foods had been eaten, he asked his parents, “Father, Mother, who ate the kulmāṣa in the pot and soup in the small pot?”

source: དེ་གཉིས་ཀྱིས་འདི་སྐད་ཅེས་སྨྲས་སོ། །དགའ་སྐྱོང་ཁྱོད་འདི་ནས་ཕྱིར་བྱུང་བ་ན་བདག་ཅག་གིས་སྒོ་འཕར་ལ་རྡུང་བའི་སྒྲ་ཞིག་ཐོས་སོ། །ཐོས་ནས་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: “ ‘ “Nandīpāla,” they answered, “when you were away, we heard the gate crossbar being knocked.

source: །འཕགས་པ་འདི་སུ་ཞིག་བཞིན་བཟངས་འདི་སུ་ཞིག་སྒོ་འཕར་ལ་རྡུང་། དེས་འདི་སྐད་ཅེས་གསུངས་སོ། །ང་ནི་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་ཡིན་ཏེ་བསོད་སྙོམས་བཞེད་དོ། །དེ་ལ་བདག་ཅག་གིས་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: When we heard it, we asked, ‘Which noble one, which gentleman, is knocking on the gate crossbar of the potter Nandīpāla?’ He answered, ‘I am the Completely Awakened One Kāśyapa and asking for almsfood.’ We said to him, ‘O noble one, please come in.

source: །འཕགས་པ་ནང་དུ་སྤྱོན་ཅིག །བཞིན་བཟངས་ནང་དུ་སྤྱོན་ཅིག །ཁྱོད་ལ་རིམ་གྲོ་བགྱིད་པ་ནི་སླད་རོལ་དུ་མཆིས་ཀྱིས་ཕྲུ་བ་ན་ཟན་དྲོན་དང་། རྫེའུ་ན་སྲན་ཚོད་མཆིས་ཀྱིས་ཉིད་ཀྱིས་བཞེས་ལ་ལོངས་སྤྱད་དུ་གསོལ།
en: O sir, please come in. The one who would serve you is away. There is kulmāṣa in a pot and soup in a small pot. Please help yourself.’ Then he ate those.”

source: དེས་དེ་དག་ལོངས་སྤྱད་པར་གྱུར་ཏོ། །དེ་ནས་རྫ་མཁན་དགའ་སྐྱོང་འདི་སྙམ་དུ་སེམས་ཏེ། ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་གིས་བདག་གི་ཁྱིམ་དུ་ཤིན་ཏུ་བག་ཕབ་ཅིང་འདྲིས་པར་གྱུར་པ་ནི་བདག་གིས་རྙེད་པ་ལེགས་པར་རྙེད་དོ་སྙམ་ནས་དགའ་བ་དང་རབ་ཏུ་དགའ་བས་སྐྱིལ་མོ་ཀྲུང་བཅས་ཏེ་ཞག་བདུན་འདས་པར་བྱས་སོ།
en: “ ‘The potter Nandīpāla thought, “I have attained a great boon, for the Completely Awakened One Kāśyapa felt at ease and relaxed at my house.” Pleased and delighted, he spent seven days sitting with his legs crossed.

source: །ཟླ་བ་ཕྱེད་ཀྱི་བར་དུ་ཡང་དེའི་ལྷན་ཅིག་ལྡན་པའི་དགའ་བ་ལུས་མི་འདོར་ཞིང་དེ་རྟག་ཏུ་ལུས་ལ་བར་ཆད་མེད་པར་འདུག་གོ།
en: For as long as half a month, joy did not leave his body, and he never had any problem in his body.

source: །འདི་ལྟར་སངས་རྒྱས་རྣམས་ཀྱི་སངས་རྒྱས་ཀྱི་མཐུ་དང་། ལྷ་རྣམས་ཀྱི་ལྷའི་མཐུས་ཞག་བདུན་གྱི་བར་དུ་ཕ་དང་མ་གཉིས་ཀྱི་ཕྲུ་བའི་ཟན་དྲོན་དང་རྗེའུའི་སྲན་ཚོད་ཀྱང་དེ་བཞིན་དུ་འདུག་གོ་རྒྱལ་པོ་ཆེན་པོ་དུས་གཅིག་ན་ང་བཻ་བྷི་ཊིང་གི་ལྗོངས་ཀྱི་གྲོང་རྡལ་དུ་ཉེ་བར་བརྟེན་ཏེ་དབྱར་གནས་པར་དམ་བཞེས་པ་དང་། ངའི་གཙུག་ལག་ཁང་དུ་ཆར་འབེབས་པའི་ལྷས་ཐོག་མར་ཆར་ཕབ་པར་གྱུར་ཏོ།
en: By the awakened power of the buddhas and the divine power of the gods, the kulmāṣa in the pot and the soup in the small pot remained for his parents for the seven days. “ ‘Great King, once when I spent the rainy-season retreat near the provincial town of Vaibhiḍiṅgī, the god who brings rain caused the first rain to fall on my monastery.

source: །དེའི་ཚེ་རྫ་མཁན་དགའ་སྐྱོང་གི་ལས་བྱེད་པའི་ཁང་པ་རྩྭ་སར་པས་གཡོགས་སོ།
en: At that time, the potter Nandīpāla’s workshop was roofed with new grass.

source: །ངའི་ཞབས་འབྲིང་བྱེད་པ་དགེ་སློང་རྣམས་ལ་བཀའ་སྩལ་པ། དགེ་སློང་དག་ཁྱེད་ཅག་དེང་ལ་རྫ་མཁན་དགའ་སྐྱོང་གི་ལས་བྱེད་པའི་ཁང་པའི་གཡོགས་མས་ངའི་གཙུག་ལག་ཁང་གཡོགས་ཤིག།
en: I ordered the monks who were attending me, “Monks, you should roof my monastery with the roof of the potter Nandīpāla’s workshop today.”

source: བཙུན་པ་བཀའ་བཞིན་འཚལ་ཞེས་དགེ་སློང་དེ་རྣམས་ཀྱིས་ང་ལས་མཉན་ནས།
en: “ ‘ “Certainly, O Honored One,” replied the monks to me.

source: རྫ་མཁན་དགའ་སྐྱོང་གི་ལས་བྱེད་པའི་ཁང་པའི་གཡོགས་མ་འཆུ་བར་བྱེད་པ་ན། དེའི་ཚེ་རྫ་མཁན་དགའ་སྐྱོང་དགོས་པ་འགའ་ཞིག་ལ་ཕྱི་རོལ་ཏུ་སོང་ངོ་།
en: When they removed the roof from the potter Nandīpāla’s workshop, he was away on some business.

source: །རྫ་མཁན་དགའ་སྐྱོང་གི་ཕ་དང་མ་གཉིས་ཀྱིས་ལས་བྱེད་པའི་ཁང་པའི་གཡོགས་མ་འཆུ་བའི་སྒྲ་ཐོས་སོ། །ཐོས་ནས་ཀྱང་འདི་སྐད་ཅེས་སྨྲས་སོ། །འཕགས་པ་འདི་སུ་ཞིག་བཞིན་བཟངས་འདི་སུ་ཞིག་ལས་བྱེད་པའི་ཁང་པའི་གཡོགས་མ་འཆུ།
en: When the potter Nandīpāla’s two parents heard the roof of the workshop being removed, they asked, “Which noble one, which gentleman, is removing the roof of the workshop?”

source: དེ་རྣམས་ཀྱིས་འདི་སྐད་ཅེས་སྨྲས་སོ། །ཁོ་བོ་ཅག་ནི་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་གི་ཞབས་འབྲིང་བའི་དགེ་སློང་དག་ཡིན་ཏེ།
en: “ ‘They answered, “We are monks attending on the Completely Awakened One Kāśyapa.

source: ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་གི་གཙུག་ལག་ཁང་དུ་ཆར་འབེབས་པའི་ལྷས་ཐོག་མར་ཆར་ཕབ་པས་ཁོ་བོ་ཅག་གིས་འདི་བཤུས་ཏེ་དེ་གཡོགས་སོ།
en: Since the god who brings rain caused the first rain to fall on the monastery of the Completely Awakened One Kāśyapa, we are removing this and will roof the monastery with it.”

source: །དེ་གཉིས་ཀྱིས་འདི་སྐད་ཅེས་སྨྲས་སོ། །ཁྱེད་ལ་རིམ་གྲོ་བགྱིད་པ་ནི་སླད་རོལ་དུ་མཆིས་ཀྱིས།
en: “ ‘The two of them replied, “The one who should serve you is away.

source: འཕགས་པ་དག་སྣོམས་ཤིག །བཞིན་བཟངས་དག་སྣོམས་ཤིག །དེ་ནས་དགེ་སློང་དེ་རྣམས་ཀྱིས་ལས་བྱེད་པའི་ཁང་པ་བཤུས་ནས་ངའི་གཙུག་ལག་ཁང་གཡོགས་སོ།
en: Noble ones, take it. Sirs, take it.” “ ‘Then the monks, having removed the roof of the workshop, roofed my monastery.

source: །དེ་ནས་ཕྱི་ཞིག་ན་རྫ་མཁན་དགའ་སྐྱོང་འོངས་ནས་རྫ་མཁན་དགའ་སྐྱོང་གིས་ལས་བྱེད་པའི་ཁང་པའི་གཡོགས་མ་བཤུས་པ་མཐོང་ངོ་།
en: After that, the potter Nandīpāla came home and saw that the roof of the workshop had been removed.

source: །མཐོང་ནས་ཀྱང་ཕ་དང་མ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །ཡབ་ཡུམ་ལས་བྱེད་པའི་ཁང་པ་འདི་སུ་ཞིག་གིས་བཤུས་དེ་གཉིས་ཀྱིས་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: When he saw this, he asked his parents, “Father, Mother, who removed the roof of this workshop?”

source: །འདི་ནས་ཁྱོད་ཕྱི་ལོགས་སུ་སོང་བ་ན་བདག་ཅག་གིས་ལས་བྱེད་པའི་ཁང་པའི་གཡོགས་མ་འཆུ་བའི་སྒྲ་ཐོས་སོ།
en: “ ‘They answered, “When you were away, we heard the roof of the workshop being removed.

source: །ཐོས་ནས་ཀྱང་འདི་སྐད་ཅེས་སྨྲས་སོ། །འཕགས་པ་འདི་སུ་ཞིག་བཞིན་བཟངས་འདི་སུ་ཞིག་ལས་བྱེད་པའི་ཁང་པ་འཆུ། དེ་རྣམས་ཀྱིས་འདི་སྐད་ཅེས་སྨྲས་སོ། །ཁོ་བོ་ཅག་ནི་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་གི་ཞབས་འབྲིང་བ་དགེ་སློང་དག་ཡིན་ཏེ།
en: When we heard this, we asked, ‘Which noble one, which gentleman, is removing the roof of the workshop?’ They answered, ‘We are monks attending on the Completely Awakened One Kāśyapa.

source: ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་གི་གཙུག་ལག་ཁང་དུ་ཆར་འབེབས་པའི་ལྷས་ཐོག་མར་ཆར་ཕབ་པས་ཁོ་བོ་ཅག་གིས་འདི་བཤུས་ལ་དེ་གཡོགས་སོ།
en: Since the god who brings rain caused the first rain to fall on the monastery of the Completely Awakened One Kāśyapa, we are removing this and will roof the monastery with it.’ We said to them, ‘The one who should serve you is away.

source: །དེ་རྣམས་ལ་བདག་ཅག་གིས་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: Noble ones, take it.

source: །ཁྱེད་ཅག་ལ་རིམ་གྲོ་བགྱིད་པ་ནི་སླད་རོལ་དུ་མཆིས་ཀྱིས་འཕགས་པ་དག་སྣོམས་ཤིག །བཞིན་བཟངས་དག་སྣོམས་ཤིག །དེ་རྣམས་ཀྱིས་ལས་བྱེད་པའི་ཁང་པ་དེ་བཤུས་སོ།
en: Sirs, take it.’ They then removed the roof of the workshop.”

source: །དེ་ནས་རྫ་མཁན་དགའ་སྐྱོང་འདི་སྙམ་དུ་སེམས་ཏེ། ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་གིས་བདག་གི་ཁྱིམ་དུ་ཤིན་ཏུ་བག་ཕབ་ཅིང་འདྲིས་པར་གྱུར་པ་ནི་བདག་གིས་རྙེད་པ་ལེགས་པར་རྙེད་དོ་ཞེས་བྱ་བ་ནས་ཞག་བདུན་དུ་ཞེས་བྱ་བའི་བར་གོང་མ་བཞིན་དུའོ།
en: “ ‘Then the potter Nandīpāla thought, “I have attained a great boon, for the Completely Awakened One Kāśyapa felt at ease and relaxed at my house.” . . . he spent seven days . . . .

source: །འདི་ལྟར་སངས་རྒྱས་རྣམས་ཀྱི་སངས་རྒྱས་ཀྱི་མཐུ་དང་ལྷ་རྣམས་ཀྱི་ལྷའི་མཐུས་རྫ་མཁན་དགའ་སྐྱོང་གི་ཕ་མའི་དབྱར་གྱི་གནས་དེར་ལས་བྱེད་པའི་ཁང་པར་ཆར་པ་ཐིགས་པ་གཅིག་ཀྱང་མ་བབ་བོ།
en: By the awakened power of the buddhas and the divine power of the gods, not a drop of rain fell on the roof of the potter Nandīpāla’s parents’ workshop during the rainy-season retreat.

source: །རྒྱལ་པོ་ཆེན་པོ་ཁྱོད་ནི་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་ཟླ་བ་གསུམ་དུ་ན་བཟའ་ཆོས་གོས་དང་། བསོད་སྙོམས་དང་། གཟིམས་ཆ་དང་། སྙུན་དཔྱད་ཀྱི་རྐྱེན་སྨན་གྱི་ཡོ་བྱད་རྣམས་འབུལ་ན་མ་གནང་ངོ་། །ཞེས་ཁྱོད་ཀྱི་སེམས་གཞན་དུ་འགྱུར་གྱི། དགའ་སྐྱོང་ནི་ལས་བྱེད་པའི་ཁང་པའི་གཡོགས་མ་བཤུས་ཀྱང་སེམས་གཞན་དུ་མ་གྱུར་ཏོ།
en: “ ‘Great King, you may be disappointed, thinking, “The Completely Awakened One did not assent to my offer of the requisites for three months, namely, robes, almsfood, bedding and seats, and medicines for the sick.” However, Nandīpāla was not disappointed even when the roof of his workshop was removed.’

source: །བཙུན་པ་རྫ་མཁན་དགའ་སྐྱོང་གིས་ནི་ཐོབ་པ་ལེགས་པར་ཐོབ་ལགས་ཏེ། བཅོམ་ལྡན་འདས་ཀྱིས་དེའི་སྡུམ་པར་ཤིན་ཏུ་བག་ཕབ་ཅིང་འདྲིས་པར་གྱུར་ལགས་སོ།
en: “ ‘O Honored One, the potter Nandīpāla attained a great boon, for the Blessed One felt at ease and relaxed at his house.’

source: །དེ་ནས་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་གིས་རྒྱལ་པོ་ཀྲྀ་ཀཱིའི་སྦྱིན་པ་དེ་ལ་རྗེས་སུ་ཡི་རང་བ་འདིས་རྗེས་སུ་ཡི་རང་བར་མཛད་དེ།
en: “Then the Completely Awakened One Kāśyapa celebrated the offering made by King Kṛkin with this appreciation:

source: སྦྱིན་སྲེག་མཆོད་སྦྱིན་རྣམས་ཀྱི་མཆོག །བདེ་སྦྱོར་མཆོག་ནི་ཉི་མའི་ལྷ།
en: “Agnihotra is the best of sacrifices. The best of verses is Sāvitrī.

source: །དེ་ནས་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་གིས་རྒྱལ་པོ་ཀྲྀ་ཀཱི་ལ་ཆོས་དང་ལྡན་པའི་གཏམ་གྱིས་ཡང་དག་པར་བསྟན། ཡང་དག་པར་འཛིན་དུ་བཅུག །ཡང་དག་པར་གཟེངས་བསྟོད། ཡང་དག་པར་རབ་ཏུ་དགའ་བར་མཛད་ནས་གདན་ལས་བཞེངས་ཏེ་གཤེགས་སོ།
en: “Thereupon the Completely Awakened One Kāśyapa, having instructed, inspired, encouraged, and delighted King Kṛkin through talk consistent with the Dharma, rose from his seat and departed.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་གཤེགས་ནས་རིང་པོ་མ་ལོན་པར་རྒྱལ་པོ་ཀྲྀ་ཀཱིས་མི་ཞིག་ལ་སྨྲས་པ། ཀྭའི་ནང་རྗེ་ཁྱོད་སོང་ལ་སྦུབས་སུ་སྨིན་པའི་འབྲས་ཀྱིས་ཤིང་རྟ་ལྔ་བརྒྱ་ཙམ་ཁོང་ལ།
en: “As soon as the Blessed One left, King Kṛkin ordered a man, ‘My good man, go and fill five hundred carriages with rice covered with leaves.

source: རྫ་མཁན་དགའ་སྐྱོང་གང་ན་བ་དེར་སོང་སྟེ་ཕྱིན་པ་དང་། དེ་ལ་འདི་སྐད་ཅེས་དེས་པ་དགའ་སྐྱོང་རྒྱལ་པོ་ཀྲྀ་ཀཱིས་ཁྱོད་ལ་སྦུབས་སུ་སྨིན་པའི་འབྲས་ཀྱིས་བཀང་བའི་ཤིང་རྟ་ལྔ་བརྒྱ་ཙམ་པོ་འདི་དག་བསྐུར་གྱིས་འདིས་ཁྱོད་ཀྱི་ཕ་མ་ལོང་བ་གཉིས་གསོ་བ་དང་། ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་ལ་དུས་དུས་སུ་བསོད་སྙོམས་དབུལ་བ་དང་། བདག་ཉིད་ཀྱང་ལེགས་པར་བདེ་བས་ཚིམ་པར་བྱོས་ཤིག །ལྷ་བཀའ་བཞིན་འཚལ་ཞེས་མི་དེས་རྒྱལ་པོ་ཀྲྀ་ཀཱི་ལས་མཉན་ནས་སྦུབས་སུ་སྨིན་པའི་འབྲས་ཀྱིས་ཤིང་རྟ་ལྔ་བརྒྱ་ཙམ་བཀང་སྟེ།
en: Then go to the potter Nandīpāla, give them to him, and say, ‘O Nandīpāla, gentle sir, King Kṛkin has sent you these five hundred carriages filled with rice covered with leaves. Feed your blind parents with these, frequently offer almsfood to the Completely Awakened One Kāśyapa, and also satisfy yourself.’ “ ‘Certainly, Your Majesty,’ replied the man to King Kṛkin. Having filled five hundred carriages with rice covered with leaves, he went to Nandīpāla.

source: རྫ་མཁན་དགའ་སྐྱོང་གང་ན་བ་དེར་སོང་ནས་ཕྱིན་པ་དང་། རྫ་མཁན་དགའ་སྐྱོང་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །དེས་པ་དགའ་སྐྱོང་རྒྱལ་པོ་ཀྲྀ་ཀཱིས་ཁྱོད་ལ་སྦུབས་སུ་སྨིན་པའི་འབྲས་ཀྱིས་བཀང་བའི་ཤིང་རྟ་ལྔ་བརྒྱ་ཙམ་པོ་འདི་དག་བསྐུར་གྱིས།
en: When he arrived, he said to the potter Nandīpāla, ‘O Nandīpāla, gentle sir, King Kṛkin has sent you these five hundred carriages filled with rice covered with leaves.

source: འདིས་ཁྱོད་ཀྱི་ཕ་མ་ལོང་བ་གཉིས་གསོ་བ་དང་། ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་ལ་བསོད་སྙོམས་དབུལ་བ་དང་། བདག་ཉིད་ཀྱང་ལེགས་པར་བདེ་བས་ཚིམ་པར་བྱོས་ཤིག་ཅེས་གསུང་ངོ་།
en: Feed your blind parents with these, frequently offer almsfood to the Completely Awakened One Kāśyapa, and also satisfy yourself.’

source: །ཀྱེ་ནང་རྗེ་རྒྱལ་པོ་ཀྲྀ་ཀཱི་ནི་དགོས་པ་མང་ཞིང་བྱ་བ་མང་བ་ཡིན་ལ། བདག་ནི་དགོས་པ་ཉུང་ཞིང་བྱ་བ་ཉུང་བ་ཡིན་ནོ་ཞེས་སྨྲས་ནས་མ་བླངས་སོ།
en: “ ‘My good man,’ replied Nandīpāla, ‘King Kṛkin has many duties and many things to do, but I have few duties and few things to do.’ He did not accept them.

source: དེའི་ཚེ་དེའི་དུས་ཀྱི་བྲམ་ཟེའི་ཁྱེའུ་བླ་མ་གང་ཡིན་པ་དེ་ནི་ང་ཉིད་ཡིན་ཏེ།
en: That one who was the young brahmin Uttara at that time, on that occasion, was indeed me. I did slander the person, but not awakening itself.

source: ངས་གང་ཟག་ལ་སྐུར་གྱི་བྱང་ཆུབ་ལ་མ་ཡིན་པ་གང་ཡིན་པ་དེའི་ལས་ཀྱི་རྣམ་པར་སྨིན་པས་བྱང་ཆུབ་ཀྱི་སྙིང་པོར་དཀའ་བ་ལོ་དྲུག་སྤྱད་དོ། །གལ་ཏེ་ངས་བྱང་ཆུབ་ལ་བསྐུར་བར་གྱུར་ན། ངས་སླར་ཡང་བསྐལ་པ་གྲངས་མེད་པ་གསུམ་དུ་བྱང་ཆུབ་ཀྱི་ཆེད་དུ་བདག་ཉིད་ཤིན་ཏུ་དུབ་པར་འགྱུར་རོ།
en: Because of the maturation of that karma, I did ascetic practice at the site of awakening for six years. If I had slandered awakening itself, I would have had to exhaust myself for awakening for another three incalculably long eons.” h.

source: །བཙུན་པ་བཅོམ་ལྡན་འདས་ཀྱིས་ཕྲིན་ལས་ཅི་ཞིག་མཛད་ན། ཕྲིན་ལས་དེའི་རྣམ་པར་སྨིན་པས་མངོན་པར་རྫོགས་པར་བྱང་ཆུབ་པ་ན་ཡང་བཅོམ་ལྡན་འདས་ལ་འཁྲུ་བའི་སྙུན་གྱིས་ཐེབས་ལགས།
en: A Physician “O Honored One, what karma did the Blessed One create that matured to cause him to have an attack of diarrhea while being the Buddha, who had perfectly accomplished awakening?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། དགེ་སློང་དག་དེ་བཞིན་གཤེགས་པ་ཉིད་ཀྱིས་སྔོན་གྱི་ཚེ་རབས་གཞན་རྣམས་སུ་ལས་འདི་དག་བྱས་ཤིང་བསགས་པ་ཞེས་བྱ་བ་ནས།
en: “Monks,” the Blessed One replied, “the actions were performed and accumulated by the Tathāgata himself in other lives in the past . . . “. . .

source: །དགེ་སློང་དག་སྔོན་བྱུང་བ་རི་འོར་ཞིག་ན་སྨན་པ་ཞིག་ཡོད་པ་ལས་དེ་ན་ཁྱིམ་བདག་ཅིག་གི་བུ་ནད་ཀྱིས་ཐེབས་ནས།
en: “Monks, once there was a physician in a certain hamlet. A son of a householder there caught a disease.

source: དེས་སྨན་པ་དེ་བཀུག་སྟེ་དྲིས་ནས་དེས་དེ་ལ་སྨན་བྱིན་པས་སོས་པར་གྱུར་ན།
en: He called the physician and asked him what to do. The physician gave him medicine, and thus the patient’s health returned.

source: ཁྱིམ་བདག་དེས་དེ་ལ་རྔན་པ་མ་བྱིན་ནོ།
en: However, the householder did not pay him the fee.

source: །ཁྱིམ་བདག་གི་བུ་དེ་ལན་གསུམ་གྱི་བར་དུ་ནད་ཀྱིས་ཐེབས་ཏེ། སྨན་པ་དེས་ལན་གསུམ་གྱི་བར་དུ་སོས་པར་བྱས་ཀྱང་དེས་དེ་ལ་རྔན་པ་མ་བྱིན་ནས་དེ་ནས་སྨན་པ་དེ་ཀུན་ནས་དཀྲིས་པ་དྲག་པོས་མི་བཟོད་པར་གྱུར་ནས་བསམས་པ། ཁྱིམ་བདག་གི་བུ་འདི་བདག་གིས་ལན་གསུམ་གྱི་བར་དུ་དཔྱད་བྱས་ཀྱང་འདིས་ཅུང་ཟད་ཀྱང་ལན་དུ་ཕན་མ་བཏགས་ཀྱིས། ད་ནི་བརྒྱ་ལ་ནད་ཀྱིས་ཐེབས་པར་གྱུར་དང་། དེ་ལ་སྨན་མ་ཡིན་པ་གང་ཞིག་གིས་དེའི་ནང་གྲོལ་རྣམས་དུམ་བུ་དུམ་བུར་འཛག་པར་འགྱུར་བ་དེ་ལྟ་བུ་སྦྱིན་ནོ་སྙམ་པ་ལས་ཇི་ཙམ་ན་ཁྱིམ་བདག་དེའི་བུ་མ་བདེ་སྟེ་སླར་ན་བར་གྱུར་པ་དང་། སྨན་པ་དེས་མི་བཟོད་པ་སྐྱེས་པས།
en: The householder’s son caught a disease three times and had his health restored by the physician three times, but the householder still did not pay him the fees. Thereupon, the physician, unable to bear it, thought in fierce anger, ‘Although I have treated this householder’s son three times, he has never paid me anything. Now, if by any chance the son catches a disease, I will give him a poison that will cause his intestines to be shredded into pieces and drop out.’ “Later, the householder’s son felt sick and became ill again.

source: དེ་ལ་སྨན་མ་ཡིན་པ་བྱིན་ནས་དེས་ནང་གྲོལ་རྣམས་དུམ་བུ་དུམ་བུར་ཟགས་སོ།
en: Feeling an unbearable anger, the physician gave him poison, and so his intestines were shredded into pieces and dropped out.

source: དེའི་ཚེ་དེའི་དུས་ཀྱི་སྨན་པ་གང་ཡིན་པ་དེ་ནི་ང་ཉིད་ཡིན་ཏེ།
en: That one who was the physician at that time, on that occasion, was indeed me.
